[
  {
    "name": "ALSAC - St. Jude Children's Research Hospital",
    "location": "Memphis, TN",
    "mission": "ALSAC (American Lebanese Syrian Associated Charities) was founded in 1957 and exists for the sole purpose of raising funds to support the operating and maintenance of St. Jude Children's Research Hospital. The mission of St. Jude Children's Research Hospital is to find cures for children with cancer and other catastrophic diseases through research and treatment. It is supported primarily by donations raised by ALSAC. ",
    "link": "https://www.stjude.org/",
    "imgLink": "https://www.stjude.org/content/sites/www/en_US/home/jcr:content/par-1/cnt_mosaic/slide_451255992/defaultImage.img.500.high.jpg/1669902139157.jpg",
    "ein": "35-1044585"
  },
  {
    "name": "CDC Foundation",
    "location": "Atlanta, GA",
    "mission": "The CDC Foundation helps the Centers for Disease Control and Prevention (CDC) save and improve lives by unleashing the power of collaboration between CDC, philanthropies, corporations, organizations and individuals to protect the health, safety and security of America and the world. The CDC Foundation is the go-to nonprofit authorized by Congress to mobilize philanthropic partners and private-sector resources to support CDC's critical health protection mission.",
    "link": "https://www.cdcfoundation.org/",
    "imgLink": "https://www.cdcfoundation.org/sites/default/files/styles/large/public/2021-06/iStock-1220621141.jpg.jpeg?itok=lvf_Mcny",
    "ein": "58-2106707"

  },
  {
    "name": "Save The Children",
    "location": "Fairfield, CT",
    "mission": "Save the Children believes every child deserves a future. Since our founding over 100 years ago, we've changed the lives of over 1 billion children. In the United States and around the world, we work every day to give children a healthy start in life, the opportunity to learn and protection from harm. When crisis strikes, and children are most vulnerable, we are always among the first to respond and the last to leave.",
    "link": "https://www.savethechildren.org/",
    "imgLink": "https://www.savethechildren.org/content/dam/global/images/countries/somalia/somalia-hunger-ahmed-ch1535822-sq.jpg/_jcr_content/renditions/cq5dam.webp_thumbnail.2562.2562.webp",
    "ein": "06-0726487"
  },
  {
    "name": "Unicef",
    "location": "New York, NY",
    "mission": "Over eight decades, the United Nations Children's Fund (UNICEF) has built an unprecedented global support system for the world's children. UNICEF relentlessly works day in and day out to deliver the essentials that give every child an equitable chance in life: health care and immunizations, safe water and sanitation, nutrition, education, emergency relief and more. UNICEF USA advances the global mission of UNICEF by rallying the American public to support the world's most vulnerable children.",
    "link": "https://www.unicefusa.org/",
    "imgLink": "https://www.unicefusa.org/sites/default/files/styles/standard_layout_banner/public/field-images/story-banner/2022/UN0640824%20%281%29.jpg.Banner_0.jpg?itok=c1GZsy-l",
    "ein": "13-1760110"
  },
  {
    "name": "Doctors Without Borders",
    "location": "New York, NY",
    "mission": "Doctors Without Borders, USA (DWB-USA) was founded in 1990 in New York City to raise funds, create awareness, recruit field staff, and advocate with the United Nations and US government on humanitarian concerns. Doctors Without Borders/Médecins Sans Frontières (MSF) is an international medical humanitarian organization that provides aid in nearly 60 countries to people whose survival is threatened by violence, neglect, or catastrophe, primarily due to armed conflict, epidemics, malnutrition, exclusion from health care, or natural disasters.",
    "link": "https://www.doctorswithoutborders.org/",
    "imgLink": "https://www.doctorswithoutborders.org/sites/default/files/styles/crop_focus_issues_desktop_/public/image_base_media/2020/04/MSF311836.jpg?itok=RIyiXVhO",
    "ein": "13-3433452"
  }
]